#რომელ ბიბლიოთეკას ვიყენებთ პითონში გეომეტრიული ფიგურების ასაღებად?
#პასუხია turtle
#turtle ს გამოყენებით ავაგებთ გეომეტრიულ ფიგურებს პითონში


#რომელ ფუნქციას ვიყენებთ, როდესაც გვინდა რომ terminal-ში მოვახდინოთ დაბეჭვდა?
#პასუხია print
#printi არის ფუნქცია რომლის საშვალებით შეგვიძლია კოდი გამოვიტანოთ terminal-ში


#პითონში შეუძლებელია ალგორითმების შექმნა 
#პასუხია False
#პითონში შესაძლებელია ალგორითმების შექმნა


#ათწილადზე სამუშაოდ რომელ მონაცემთა ტიპს ვიყენებთ
#პასუხია float
#float-ის გამოყენებით შევძლებთ ათწილადზე მუშაობას


#რომელია პითონის სწორი კომენტარი
#პასუხია #
# #- საშვალებით სეგვიძლია პითნში რაიმე თექსტი კომენტარის სახით ჩავწეროთ


#რომელ ფუნქციას ვიყენებთ მომხმარებლისგან terminal-იდან ტექსტის მისაღებად
#პასუხია input
#input ფუნქცის საშვალებით მომხმარებელს შეუძლია Terminal-ში რაიმე ტექსტის დაწერა 


#input-იდან მიღებული ინფორმაცია ინახება string-ის სახით
#პასუხია True 
#სწორია იმიტორო string-ი არის იგივე ტექსტი 


#როგორ ვამოწმებთ მონაცემთა ტიპს
#პასუხია type()
#type ნიშნავს ტიპს რომლის საშვალებითაც ვგებულობთ ჩვენ მიერ დაწერილი კოდი რა ტიპისაა მაგალითად:string-ი integer-ი და ა.შ


#რომელი ცვლადი ინახავს ათწილადს
#პასუხია x = 10/2
#x = 10/2 ეს დახრილი ხაზი ნიშნავს გაყოფას ჩვენ როცა ამ კოდს გავუშვებთ გამოიტანს ათ წილად იმიტომ რომ ერთი დახრილი ხაზია


#რომელ ვარიანტშია სწორად ცვლადი შექმნილი
#პასუხია x = 12
#x არის  ცვლადი, 12 არის მნიშვნელი სადაც შეგვიძლია ნებისმიერი რამე დავწეროთ და = ნიშნავს ანუ ცვლადი უდრის მნიშვნელს


#რას გამოიტანს კოდი:
#name = "goal"
#surname = "oriented"
#age = 100
#print(name + surname + age)
#პასუხია error
#რადგან integer-ი და string-ი ერთად არცერთ ვარიანტში დაიწერება ერთად


#რას გამოტანს კოდი:
#num1 = 10
#num2 = 20
#print(str(num1) + str(num2))
#პასუხია 1020
#ჩვენ რომ ამ კოდში str-ები არ დაგვემატა პასუხი იქნებოდა 30 რადგან string-ი ნიშნავს ტექსტს და პროგრამამ ეს კოდი აღიქვა string-ად


#რას გამოიტანს კოდი:
#num1 = float(input("enter number:    "))
#print(type(num1))
#პასუხია (classs "float")
#იმიტომ რომ ტიპი არის float-ი


#x =((True and false) or (false or False))
#y = ((false or True) and (false and True))
#print((x and y) or True)
#პასუხია True


#რას გამოიტანს კოდი როდესაც მომხმარებელი შეიტანს 20-ს:
#age - int(input("enter your age:   "))
#print(age > 18)
#პასუხია true 
#რადგან 20 მეტია 18-ზე

