#რა არის პითონი პროგრამირებში
# პროგრამული ენა
# პითონის დახმარებიტ შეგვიზლია დავწეროთ კოდები

# რა არის turtle პითონში
# library


# რას გამიტანს კოდი ტერმინაშლი
# print("heloo world")
# heloo world
# პრინტი არის ფუნქცია რომელსაც ტერმინალსი გამოაქ რასაც დავწერთ ამიტომაც გამოიტანს heloo world_ს


# რას გამოიტანს კოდი ტერმინალში
# print(True > False)
# True

# რითი ვქმნით პითონში კომენტარს
# #

# რას გამოტანს კოდი ტერმინალში
# x = 15
# y = 4
# print(x // y)
# 3

# რას გამოიტანს კოდი ტერმინალში
# x = 10
# y = 4
# print(x / y)
# 2.5

# # რას გამოიტანს კოდი
# x = 10
# y = "20"
# print(x + y)


# რას გამოიტანს კოდი ტერმინალში
# x = 5
# y = 2
# print(x ** y)


# if მუშაობს else- გარეშე
# True


# რითი მთავრდება for loop
# break


# რა იქნება თუ 10 % 3
# 1


# integer-ი მრავლდება string-ზე
# True


# რას გამოტანს კოდი ტერმინაშსი
# print(3>4 or 3<5 and 500<400 or 320>244)
# True


# რარის list
# array


# რა არის ალგორითმი 
# მოქმედების ნაბიჯ-ნაბიჯ შესრულება


# პითონი გველია თ კუდი
# კუდი


# დავითი უსმენს როკის სტილის მუსიკებს
# True


# ბატონი გაბრიელი უსმენს მამა პაპურ ქართულ მუსიკებს
# False


# რომელი ხინკალი ჯობია 
# ფასანაურის ხინკალის