# რა არის პითონი პროგრამირებში
# პროგრამული ენა
# პითონის დახმარებიტ შეგვიზლია დავწეროთ კოდები

# რა არის turtle პითონში
# library


# რას გამიტანს კოდი ტერმინაშლი
# print("heloo world")
# heloo world
# პრინტი არის ფუნქცია რომელსაც ტერმინალსი გამოაქ რასაც დავწერთ ამიტომაც გამოიტანს heloo world_ს


# რას გამოიტანს კოდი ტერმინალში
# print(True > False)
# True

# რითი ვქმნით პითონში კომენტარს
# #

# რას გამოტანს კოდი ტერმინალში
# x = 15
# y = 4
# print(x // y)
# 3

# რას გამოიტანს კოდი ტერმინალში
# x = 10
# y = 4
# print(x / y)
# 2.5

# # რას გამოიტანს კოდი
# x = 10
# y = "20"
# print(x + y)
# eror-ს

# რას გამოიტანს კოდი
# x = 5
# y = 2
# print(x ** y)
# 25


# if მუშაობს else გარეშე
# True

# რითი მთავრდება for loop
# break


# რა იქნება თუ 10 % 3
# 1


# intege-რი მრავლდება string-ზე
# True


# print(3>4 or 3<5 and 500<400 or 320>244)
# True


# რარი list-ი
# array


# რარის ალგორითმი
# მოქმედების ნაბიჯ-ნაბიჯ შესრულება


# პითონი გველია თუ კუდი 
# კუდი


# დავითი უსმენს როკის სტილის მუსიკას
# True


# ბატონი გაბრიელი არ უსმენს მამა პაპურ ქართულ მუსიკებს
# false


# გაკვეთილი ჩატარდა კამფეტივით 
# True

# რომელი ხინკალი ჯობია
# ფასანაური ხინკალი