# მოსწავლეს შემოატანინეთ სკოლის ტესტში მიღებული ნიშანი,
# თუ ეს მიღებული ნიშანი უდრის 10 - ს, მაგ შემთხვევაში მასწავლებელმა,
# მშობელთან შეაქოს მოსწავლე, თუ მიღებული ნიშანი უდრის 8 -ს ან 9 - ს, მაგ შემთხვევაში,
# მასწავლებელმა, მშობელს პატარა შენიშვნა მისცეს. თუ მიღებული ქულა უდრის 5  - ს მაგ შემთხვევაში,
# მასწავლებელმა, მშობელს მისცეს შენიშვნა, ხოლო თუ მიღებული ნიშანი
# ნაკლებია 5 ზე, მაგ შემთხვევაში, მასწავლებელმა გააგდოს მოსწავლე სკოლიდან
test_score = int(input("რა მიიღე ტესტში:   "))
score1 = 9
score2 = 8
score3 = 5
score4 = 3

if test_score > score1: 
    print("თქვენი შვილი ძალიან კარგი ბიჭია")

if test_score < score1:
    print("თქვენმა შვილმა ცოტა კიდე რო მოინდომოს  10_იანი ეყოლება")

if test_score < score2:
    print("თქვენმა შვილმა ცოტა კიდე რო მოინდომოს  10_იანი ეყოლება")

if test_score < score3:
    print("თქვენი შვილი ძალიან ზარმაცია მან თუ ესე გააგრძელა სკოლიდან გავრიცხავთ")

if test_score < score4:
    print("თქვენი შვილი გავარდა სკოლიდან ")